artillery.yml
config:
  target: 'http://localhost:80'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Small WarmUp!
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 40
    #   name: Ramping up the Looooad!
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained Load
  engines:
   socketio-v3: {}
  # http:
  #   headers:
  #     X-Forward-For: {{userIP}}
scenarios:
  # - name: 'Emit an event'
  #   engine: socketio-v3
  #   flow:
  #     - think: 30
      # - emit: 
      #     channel: "server-info"
  - name: 'move event'
    engine: socketio-v3
    flow:
      - think: 1
      - emit:
          channel: "move"
          data: "hi" 
# variables:
#   userIP: ["192.168.1.100","192.168.1.101","192.168.1.102","192.168.1.103"]